{
    "products": [
        {
            "id": "1",
            "title": "Cien Años de Soledad",
            "description": "Mito por derecho propio Cien años de soledad cuenta la saga de la familia Buendía y su maldición, que castiga el matrimonio entre parientes dándoles hijos con cola de cerdo. Como un río desbordante, a lo largo de un siglo se entretejerán sus destinos por medio de sucesos maravillosos en el fantástico pueblo de Macondo, en una narración que es la cumbre indiscutible del realismo mágico y la literatura del boom. Alegoría universal, es también una visión de Latinoamérica y una parábola sobre la historia humana.",
            "price": 9.99,
            "quantity": 2,
            "images": [
                { "id": 1, "url": "/cart-images/book1_1.jpg" },
                { "id": 2, "url": "/cart-images/book1_2.jpg" },
                { "id": 3, "url": "/cart-images/book1_3.jpg" }
            ]
        },
        {
            "id": "2",
            "title": "Eloquent Javascript",
            "description": "This much anticipated and thoroughly revised third edition of Eloquent JavaScript dives deep into the JavaScript language to show you how to write beautiful, effective code. It has been updated to reflect the current state of Java¬Script and web browsers and includes brand-new material on features like class notation, arrow functions, iterators, async functions, template strings, and block scope. A host of new exercises have also been added to test your skills and keep you on track.",
            "price": 4.99,
            "quantity": 3,
            "images": [
                { "id": 1, "url": "/cart-images/book2_1.jpg" }
            ]
        },
        {
            "id": "3",
            "title": "Programming Typescript",
            "description": "If you are a programmer with intermediate JavaScript experience, author Boris Cherny will teach you how to master the TypeScript language. You’ll understand how TypeScript can help you eliminate bugs in your code and enable you to scale your code across more engineers than you could before.",
            "price": 19.99,
            "quantity": 1,
            "images": [
                { "id": 1, "url": "/cart-images/book3_1.jpg" },
                { "id": 2, "url": "/cart-images/book3_2.jpg" }
            ]
        }
    ]
}